# -*- coding: utf-8 -*-
import re

def dict_replace(text):
  Dict = {
    "าํ": "ำ", "า้": "้า", "ใชง้าน": "ใช้งาน", "ดงั": "ดัง", "เคชนั": "เคชัน", "แ้": "้แ", "พนั": "พัน", "เวบ็": "เว็บ",
    "อตัรา": "อัตรา", "ค่าใชจ่้าย": "ค่าใช้จ่าย", "ลอ้ม": "ล้อม", "สญัลกัษณ์": "สัญลักษณ์", "เกบ็": "เก็บ", "บนั": "บัน",
    "กบั": "กับ", "หอ้": "ห้อ", "พฒันา": "พัฒนา", "ซบัซอ้น": "ซับซ้อน", "หนกั": "หนัก", "คญั": "คัญ", "จดั": "จัด",
    "สญั": "สัญ", "ยาลยั": "ยาลัย", "ยนืยนั": "ยืนยัน", "หลกั": "หลัก", "คน้": "ค้น", "ผดิ": "ผิด", "พวิ": "พิว",
    "หวั": "หัว", "บทคดัยอ่": "บทคัดย่อ", "ตน้": "ต้น", "ทบั": "ทับ", "จงั": "จัง", "ลว้": "ล้ว", "บริษทั": "บริษัท",
    "วตัถุ": "วัตถุ", "นอ้ย": "น้อย", "สารบญั": "สารบัญ", "ตวั": "ตัว", "ยงั": "ยัง", "ดว้ย": "ด้วย", "รุ่น": "รุ่น",
    "ตอ้ง": "ต้อง", "ขอ้": "ข้อ", "กนั": "กัน", "แจง้": "เเจ้ง", "อ้างองิ": "อ้างอิง", "จำกดั": "จำกัด", "ดบั": "ดับ",
    "ลงั": "ลัง", "รหสั": "รหัส", "บตัร": "บัตร", "ยดืหยุน่": "ยืดหยุ่น", "ภยั": "ภัย", "เพยีง": "เพียง", "สนบัสนุน": "สนับสนุน",
    "ลกัษณะ": "ลักษณะ", "ประวิตั": "ประวัติ", "สลบั": "สลับ", "ความชนั": "ความชัน", "คุน้เคย": "คุ้นเคย", "ออ้ย": "อ้อย",
    "นํ ำตาล": "น้ำตาล", "มหาวทิ": "มหาวิท", "หัวด": "หวัด",
    "\nบทที่ ":"\nบทที่", "ประัวติผู้แต่ง":"ประวัติผู้แต่ง", "วศิวกรรม": "วิศวกรรม", "ใชก้าร":"ใช้การ", "กติติกรรมประกาศ":"กิตติกรรมประกาศ"
    , "ให่ม":"ใหม่", "ประหยดั":"ประหยัด", "ใชทรั้พ": "ใช้ทรัพ",
    "อนุัมติ":"อนุมัติ", "วชิา":"วิชา", "วทิย์":"วิทย์", "อาจารยที่์": "อาจารย์ที่", "จาักน้น":"จากนั้น", "ไดท้ำ":"ได้ทำ", "ไดมี้":"ได้มี", "ไดพฒั้นา":"ได้พัฒนา"
    , "ไดท้้ัง":"ได้ทั้ง", "ผูมี้":"ผู้มี", "ผูศึ้กษา":"ผู้ศึกษา"
    , "ได้่สัง":"ได้สั่ง", "ใหค้ำ":"ให้คำ", "จารยภ์าค":"จารย์ภาค", "ที่ได":"ที่ได้", "ป้ระสิท":"ประสิท", "ปัฏิบติ":"ปฏิบัติ", "ไดศึ้กษา":"ได้ศึกษา"
    , "ผูัจด้":"ผู้จัด", "ไดรั้บ":"ได้รับ", "ผลกัดัน":"ผลักดัน", "ใกลชิ้ด":"ใกล้ชิด", "ใหักบ้":"ให้กับ","ที่์":"ที่","ใช":"ใช้","ประจำวนั":"ประจำวัน"
    ,"ไดจ้าก":"ได้จาก","อุปกรณ์้":"อุปกรณ์", "นัน":"นั้น", "ประยกุต์":"ประยุกต์", "ประสงค":"ประสงค์", "ใหดี้":"ให้ดี", "ผูที่้":"ผู้ที่"
    , "ห้องพกั":"ห้องพัก", "สวิตช":"สวิตช์", "ใช้ักน้":"ใช้ักัน", "ที่พกั":"ที่พัก", "พั้ฒนา":"พัฒนา", "ไดว้่า":"ได้ว่า"
    , "ซอ้น":"ซ้อน", "ได้รั้บ":"ได้รับ", "พร้อมักน":"พร้อมกัน", "น้้ัน":"นั้น", "โดัย":"โดย", "ใหกั้บ":"ให้กับ", "ท่ว":"ทั่ว"
    , "อยูักบ่":"อยู่กับ", "โตต้อบ":"โต้ตอบ", "ส่วนให่ญ":"ส่วนใหญ่", "ผลดักัน":"ผลัดกัน", "ใช้ักบ้":"ใช้กับ", "ผูสู้ง":"ผู้สูง", "วิทยสืุ่อ":"วิทยุสื่อ", "อาศยั":"อาศัย"

  }
  text = re.sub('\sา', 'ำ', text)
  text = re.sub('\sำ', 'ำ', text)
  text = re.sub(r'([่-๋])([ิ-ื])', r'\2\1', text)
  text = re.sub(r'(\s)([่-์]|ั|[ุ-ู])', r'\2', text)
  text = re.sub(r"(.)(า)(่)", r"\1\3\2", text)
  text = re.sub(r'([ก-ฮ])([่-์])([ุ-ู])', r'\1\3\2', text)
  text = re.sub(r'(.)([เ-ไ])([็-์]|[ุ-ู]|[ิ-ื])', r'\1\3\2', text)
  text = re.sub(r'([ก-ฮ])(ั|[่-๋])([ก-ฮ][ิ-ื]|[ก-ฮ][์])', r'\2\1\3', text)
  text = re.sub(r'([ก-ฮ])(ั|[่-๋])([\s]|[ก-ฮ][่-๋])', r'\2\1\3', text)
  text = re.sub(r'([ก-ฮ])(ั|[่-๋])([โ-ไ]|:|[เ-แ])', r'\2\1\3', text)
  text = re.sub(r'([ก-ฮ])([ก-ฮ][ิ-ื]|[ก-ฮ]ั)([ิ-ื]|ั)', r'\1\3\2', text)
  text = re.sub(r"(.)(.)(ั)([่-๋])", r"\1\4\2\3", text)
  text = re.sub(r"(\s|[ก-ฮ])([่-๋])([ก-ฮ])(ั)", r"\1\3\4\2", text)
  text = re.sub(r"(ู)([ก-ฮ])([่-๋])([่-๋])", r"\1\4\2\3", text)
  text = re.sub(r'([เ-ไ])([็-์])([ก-ฮ])', r'\1\3\2', text)
  text = re.sub(r'([.])([ดอมท])(ี)(้)', r'\1\4\2\3', text)
  regex = re.compile("(%s)" % "|".join(map(re.escape, Dict.keys())))
  return regex.sub(lambda mo: Dict[mo.group()], text)

##Input = "ผูป่้วย"
##print("input", Input)
##print("output", dict_replace(Input))
